{
  "Use Cases": "उपयोग के मामले",
  "Integration": "एकीकरण",
  "The farmer inputs their geographic location into the system using an interactive map. The system then queries the NASA FIRMS API to retrieve data on recent fire activity and fire risk in the selected area. If the API indicates a high risk of fire, the system sends an alert to the farmer via email or SMS, providing details about the risk level and recommended actions.":"किसान एक इंटरैक्टिव मानचित्र का उपयोग करके सिस्टम में अपनी भौगोलिक स्थिति दर्ज करता है। सिस्टम तब चयनित क्षेत्र में हाल की अग्नि गतिविधि और अग्नि जोखिम पर डेटा पुनर्प्राप्त करने के लिए NASA FIRMS API से पूछताछ करता है। यदि एपीआई आग के उच्च जोखिम को इंगित करता है, तो सिस्टम किसान को ईमेल या एसएमएस के माध्यम से एक अलर्ट भेजता है, जो जोखिम स्तर और अनुशंसित कार्यों के बारे में विवरण प्रदान करता है।",
  "A farmer in California inputs their farm location into the system. The system detects that there is an active wildfire near their location and immediately alerts them with information on the fire's proximity and suggested safety measures.":"कैलिफ़ोर्निया में एक किसान अपने खेत का स्थान सिस्टम में इनपुट करता है। सिस्टम यह पता लगाता है कि उनके स्थान के पास सक्रिय जंगल की आग है और तुरंत उन्हें आग की निकटता के बारे में जानकारी देकर सचेत करता है और सुरक्षा उपाय सुझाता है।",
  "Farmers can list their agricultural products for auction on the platform. Buyers browse the available listings and place bids on items they wish to purchase. The auction system uses WebSockets to provide real-time updates to all participants, ensuring that bid changes are instantly reflected and that the auction process is smooth and transparent.":"किसान अपने कृषि उत्पादों को नीलामी के लिए मंच पर सूचीबद्ध कर सकते हैं। खरीदार उपलब्ध लिस्टिंग ब्राउज़ करते हैं और उन वस्तुओं पर बोली लगाते हैं जिन्हें वे खरीदना चाहते हैं। नीलामी प्रणाली सभी प्रतिभागियों को वास्तविक समय पर अपडेट प्रदान करने के लिए वेबसॉकेट का उपयोग करती है, यह सुनिश्चित करती है कि बोली परिवर्तन तुरंत प्रतिबिंबित हों और नीलामी प्रक्रिया सुचारू और पारदर्शी हो।",
  "A farmer lists a batch of organic tomatoes for auction. Buyers place bids, and as the auction progresses, WebSockets ensure that all participants see the latest bid amounts and remaining time in real-time, facilitating a dynamic bidding environment.":"एक किसान नीलामी के लिए जैविक टमाटरों का एक बैच सूचीबद्ध करता है। खरीदार बोली लगाते हैं, और जैसे-जैसे नीलामी आगे बढ़ती है, वेबसॉकेट यह सुनिश्चित करता है कि सभी प्रतिभागियों को वास्तविक समय में नवीनतम बोली राशि और शेष समय दिखाई दे, जिससे एक गतिशील बोली वातावरण की सुविधा मिल सके।",
  "The farmer inputs various data points about their crops, such as soil type, crop variety, and current growth stage. The system uses a Gaussian Naive Bayes model to analyze this data and predict the optimal type and amount of fertilizer needed. The system provides recommendations to the farmer, including the benefits of using specific fertilizers and application rates.":"किसान अपनी फसलों के बारे में विभिन्न डेटा बिंदुओं को इनपुट करता है, जैसे मिट्टी का प्रकार, फसल की विविधता और वर्तमान विकास चरण। सिस्टम इस डेटा का विश्लेषण करने और आवश्यक उर्वरक के इष्टतम प्रकार और मात्रा की भविष्यवाणी करने के लिए गॉसियन नाइव बेयस मॉडल का उपयोग करता है। प्रणाली किसान को सिफारिशें प्रदान करती है, जिसमें विशिष्ट उर्वरकों के उपयोग के लाभ और आवेदन दर भी शामिल हैं।",
  "A farmer provides data about their corn crop's soil conditions and growth stage. The system recommends a balanced fertilizer with specific nutrients, helping the farmer maximize crop yield and health.":"एक किसान अपनी मकई की फसल की मिट्टी की स्थिति और विकास चरण के बारे में डेटा प्रदान करता है। प्रणाली विशिष्ट पोषक तत्वों के साथ संतुलित उर्वरक की सिफारिश करती है, जिससे किसान को फसल की उपज और स्वास्थ्य को अधिकतम करने में मदद मिलती है।",
  "The system integrates with weather APIs to provide farmers with weather alerts and forecasts relevant to their location. This feature helps farmers plan their activities and protect their crops from adverse weather conditions.":"यह प्रणाली किसानों को उनके स्थान से संबंधित मौसम संबंधी अलर्ट और पूर्वानुमान प्रदान करने के लिए मौसम एपीआई के साथ एकीकृत होती है। यह सुविधा किसानों को उनकी गतिविधियों की योजना बनाने और उनकी फसलों को प्रतिकूल मौसम की स्थिति से बचाने में मदद करती है।",
  "A farmer receives a notification about an incoming storm and adjusts their irrigation and crop protection strategies accordingly.":"एक किसान को आने वाले तूफान के बारे में एक सूचना मिलती है और वह तदनुसार अपनी सिंचाई और फसल सुरक्षा रणनीतियों को समायोजित करता है।",
  "The system monitors crop health through various inputs like satellite imagery and sensor data. It provides farmers with insights into potential issues such as pest infestations or nutrient deficiencies.":"यह प्रणाली उपग्रह इमेजरी और सेंसर डेटा जैसे विभिन्न इनपुट के माध्यम से फसल स्वास्थ्य की निगरानी करती है। यह किसानों को कीट संक्रमण या पोषक तत्वों की कमी जैसे संभावित मुद्दों के बारे में जानकारी प्रदान करता है।",
  "The system detects signs of a pest infestation in a farmer's field and alerts them with recommended actions to mitigate the issue.":"सिस्टम किसान के खेत में कीट के संक्रमण के संकेतों का पता लगाता है और समस्या को कम करने के लिए अनुशंसित कार्रवाई के साथ उन्हें सचेत करता है।",
  "4. Additional Use Cases": "4. अतिरिक्त उपयोग के मामले",
  "4.1 Weather Alerts":"4.1 मौसम अलर्ट",
  "4.2 Crop Health Monitoring":"4.2 फसल स्वास्थ्य मॉनिटरिंग",
  "1. Fire Detection": "1. आग का पता लगाना",
  "Actor": "अभिनेता",
  "Farmer": "किसान",
  "Description": "विवरण",
  "Example Scenario": "उदाहरण स्थिति",
  "2. Auction": "2. नीलामी",
  "Auctions":"नीलामी",
  "Parts":"भाग",
  "Farmers and Buyers": "किसान और खरीदार",
  "3. Fertilizer Prediction": "3. उर्वरक पूर्वानुमान",
  "Technical Stack and Integration": "तकनीकी स्टैक और एकीकरण",
  "React": "React",
  "Tailwind CSS": "Tailwind CSS",
  "Leaflet.js": "Leaflet.js",
  "Express": "Express",
  "Mongoose": "Mongoose",
  "MongoDB": "MongoDB",
  "Socket.io": "Socket.io",
  "Technical Stack":"तकनीकी ढेर",
  "4.1 Enhanced Data Analytics:": "4.1 उन्नत डेटा विश्लेषण:",
  "1. Technical Stack Overview": "1. तकनीकी स्टैक अवलोकन",
  "2. API Integration Details": "2. API एकीकरण विवरण",
  "2.1 NASA FIRMS API Integration": "2.1 NASA FIRMS API एकीकरण",
  "Purpose": "उद्देश्य",
  "How It Works": "यह कैसे काम करता है",
  "Example Usage": "उदाहरण उपयोग",
  "2.2 WebSockets (Socket.io) for Auctions": "2.2 नीलामियों के लिए WebSockets (Socket.io)",
  "Document 3": "दस्तावेज़ 3",
  "This is the content of document 3.": "यह दस्तावेज़ 3 की सामग्री है।",
  "Welcome": "स्वागत है",
  "Select a document from the sidebar.": "साइडबार से एक दस्तावेज़ चुनें।",
  "Used for building the user interface, providing a dynamic and responsive experience.": "यूजर इंटरफेस को बनाने के लिए उपयोग किया जाता है, जो एक गतिशील और प्रतिक्रियाशील अनुभव प्रदान करता है।",
  "Provides a utility-first approach to styling, enabling rapid and consistent UI development.": "स्टाइलिंग के लिए एक यूटिलिटी-फर्स्ट दृष्टिकोण प्रदान करता है, जिससे तेजी से और संगत UI विकास सक्षम होता है।",
  "Utilized for interactive maps, allowing users to select geographic locations for fire detection and other location-based features.": "इंटरएक्टिव मैप्स के लिए उपयोग किया जाता है, जिससे उपयोगकर्ता भौगोलिक स्थानों का चयन कर सकते हैं ताकि आग की पहचान और अन्य स्थान-आधारित सुविधाओं के लिए।",
  "Acts as the backend framework, handling HTTP requests and serving data to the frontend. It interacts with various APIs and manages server-side logic.": "बैकेंड फ्रेमवर्क के रूप में कार्य करता है, HTTP अनुरोधों को संभालता है और फ्रंटेंड को डेटा प्रदान करता है। यह विभिन्न APIs के साथ बातचीत करता है और सर्वर-साइड लॉजिक प्रबंधित करता है।",
  "An ODM (Object Data Modeling) library for MongoDB, used to manage and interact with the database.": "MongoDB के लिए एक ODM (ऑब्जेक्ट डेटा मॉडलिंग) लाइब्रेरी, जिसका उपयोग डेटाबेस को प्रबंधित और इंटरएक्ट करने के लिए किया जाता है।",
  "The database used to store user data, auction listings, and other relevant information.": "डेटाबेस का उपयोग उपयोगकर्ता डेटा, नीलामी सूचियाँ, और अन्य संबंधित जानकारी को स्टोर करने के लिए किया जाता है।",
  "Implements WebSocket communication for real-time updates during auctions, ensuring immediate reflection of bids and auction status.": "नीलामी के दौरान रियल-टाइम अपडेट के लिए वेब्सॉकेट संचार को लागू करता है, जिससे बिड्स और नीलामी की स्थिति की तात्कालिक दर्शाई जाती है।",
  "A machine learning model used for predicting optimal fertilizer requirements based on crop data.": "एक मशीन लर्निंग मॉडल जिसका उपयोग फसल डेटा के आधार पर सबसे अच्छा उर्वरक आवश्यकता की भविष्यवाणी के लिए किया जाता है।",
  "To retrieve data on fire activity and risk levels based on user-provided geographic locations.": "उपयोगकर्ता द्वारा प्रदान किए गए भौगोलिक स्थानों के आधार पर आग की गतिविधि और जोखिम स्तर पर डेटा प्राप्त करने के लिए।",
  "The frontend sends location data to the backend, which then queries the NASA FIRMS API. The backend processes the API response and determines the fire risk, sending relevant alerts to the user.": "फ्रंटेंड स्थान डेटा को बैकेंड को भेजता है, जो फिर NASA FIRMS API को क्वेरी करता है। बैकेंड API प्रतिक्रिया को प्रोसेस करता है और आग के जोखिम को निर्धारित करता है, उपयोगकर्ता को संबंधित अलर्ट भेजता है।",
  "A farmer enters their location, and the system checks for recent fire activity in that area. If there is an active fire or high risk, the system alerts the farmer with necessary precautions.": "एक किसान अपना स्थान दर्ज करता है, और सिस्टम उस क्षेत्र में हाल की आग की गतिविधि की जांच करता है। यदि वहाँ एक सक्रिय आग या उच्च जोखिम है, तो सिस्टम किसान को आवश्यक सावधानियों के साथ अलर्ट करता है।",
  "To provide real-time communication for auction bidding, ensuring that all participants receive instant updates.": "नीलामी बिडिंग के लिए रियल-टाइम संचार प्रदान करने के लिए, सुनिश्चित करता है कि सभी प्रतिभागियों को तात्कालिक अपडेट प्राप्त हो।",
  "Socket.io establishes a WebSocket connection between the client and server. The server emits updates on bid changes, which are immediately received and displayed by all connected clients, facilitating a live bidding experience.": "Socket.io क्लाइंट और सर्वर के बीच वेब्सॉकेट कनेक्शन स्थापित करता है। सर्वर बिड परिवर्तन पर अपडेट जारी करता है, जो तुरंत सभी जुड़े क्लाइंट्स द्वारा प्राप्त और दर्शाया जाता है, जिससे एक लाइव बिडिंग अनुभव को सक्षम करता है।",
  "During an auction, bids are placed and updated in real-time. Socket.io ensures that all participants see the current highest bid and remaining auction time without needing to refresh their browsers.": "नीलामी के दौरान, बिड्स रियल-टाइम में प्लेस और अपडेट किए जाते हैं। Socket.io सुनिश्चित करता है कि सभी प्रतिभागियों को वर्तमान सबसे उच्च बिड और शेष नीलामी समय देखने को मिलता है बिना ब्राउज़र को रिफ्रेश किए।",
  "Future Enhancements": "भविष्य के सुधार",
  
  "Plans to integrate more advanced data analytics tools to provide deeper insights into user behavior and system performance.": "उपयोगकर्ता के व्यवहार और सिस्टम की कार्यक्षमता के बारे में गहरी जानकारी प्रदान करने के लिए अधिक उन्नत डेटा विश्लेषण उपकरणों को एकीकृत करने की योजना है।",
  "4.2 Improved Machine Learning Models: ": "4.2 उन्नत मशीन लर्निंग मॉडल:",
  "Exploring the use of more sophisticated machine learning models to enhance the accuracy of fertilizer predictions and other recommendations.": "खाद की भविष्यवाणियों और अन्य सिफारिशों की सटीकता को बढ़ाने के लिए अधिक परिष्कृत मशीन लर्निंग मॉडल के उपयोग की खोज करना।",
  "4.3 Expanded API Integrations:": "4.3 विस्तारित API एकीकरण:",
  "Looking to integrate additional third-party APIs for more comprehensive data coverage and feature expansion.": "अधिक व्यापक डेटा कवरेज और फीचर विस्तार के लिए अतिरिक्त थर्ड-पार्टी APIs को एकीकृत करने की योजना।",
  "4.4 User Feedback Integration:": "4.4 उपयोगकर्ता फीडबैक एकीकरण:",
  "Incorporating user feedback mechanisms to continuously improve the system based on real-world usage and requirements.": "वास्तविक-विश्व उपयोग और आवश्यकताओं के आधार पर सिस्टम में निरंतर सुधार के लिए उपयोगकर्ता फीडबैक तंत्र को शामिल करना।"
}
